<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<!-- placeholder-3 -->
<details><summary>Plan: 1 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-16T07:01:28Z [(view log)](https://github.com/perchnet/p/actions/runs/17005619471/job/48214731736#step:11:1).
</summary>

```hcl

Error: Invalid value for variable

  on .terraform/modules/debian13/modules/vm/download.tf line 14, in module "cloud_image":
  14:   image_content_type       = each.value.download.content_type
    ├────────────────
    │ var.image_content_type is "import"

Invalid content type: import.

This was checked by the validation rule at
.terraform/modules/debian13/modules/image/variables.tf:43,3-13.

Error: Invalid value for variable

  on .terraform/modules/ubuntu22/modules/vm/download.tf line 14, in module "cloud_image":
  14:   image_content_type       = each.value.download.content_type
    ├────────────────
    │ var.image_content_type is "import"

Invalid content type: import.

This was checked by the validation rule at
.terraform/modules/ubuntu22/modules/image/variables.tf:43,3-13.
te... [id=L74]
module.proxmox_images.random_id.image_id["debian_trixie"]: Refreshing state... [id=oRA]
module.proxmox_images.random_id.image_id["coreos_img"]: Refreshing state... [id=UWA]
module.proxmox_images.random_id.image_id["ubuntu_noble_cloud_image"]: Refreshing state... [id=mn8]
data.onepassword_vault.perchnet_vault: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e]
data.onepassword_item.proxmox_api: Reading...
data.onepassword_item.tailscale_apikey: Reading...
data.onepassword_item.github_infra_app: Reading...
data.onepassword_item.proxmox_ssh: Reading...
data.onepassword_item.tailscale_apikey: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/cvh7gepgwlnb7yxtkxsvlsokti]
tailscale_tailnet_key.tailscale_key: Refreshing state... [id=kF1LcQMPHg11CNTRL]
data.onepassword_item.proxmox_ssh: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/7sa3h66bvyxryglelfxsruzzhu]
module.pkcs8_to_pem.data.external.pkcs8_to_pem: Reading...
data.onepassword_item.github_infra_app: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/bfyitfe53xaaelfs2kz73nbreq]
data.onepassword_item.proxmox_api: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/cig4t223gv7xmcrzdxtwmtffx4]
github_repository.p_repository: Refreshing state... [id=p]
github_repository_ruleset.p_merge_queue: Refreshing state... [id=6621869]
module.pkcs8_to_pem.data.external.pkcs8_to_pem: Read complete after 1s [id=-]
module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_trixie"]: Refreshing state... [id=zssd-files:iso/TFimg_debian-13-genericcloud-amd64-a110.qcow2.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"]: Refreshing state... [id=zssd-files:iso/TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"]: Refreshing state... [id=zssd-files:iso/TFimg_fedora-coreos-42-5160.20250803.2.0-proxmoxve.x86_64.qcow2.xz.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_bookworm"]: Refreshing state... [id=zssd-files:iso/TFimg_debian-12-nocloud-amd64-2fbe.qcow2.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"]: Refreshing state... [id=zssd-files:iso/TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.img]
module.block_storage.proxmox_virtual_environment_vm.block_storage: Refreshing state... [id=131]
terraform_data.tailscale_auth_key_stable: Refreshing state... [id=d9139c4e-dba1-2069-09b8-5db52fd518bd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-61-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->